MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/xdmac.h
/* -------- XDMAC_CC : (XDMAC Offset: 0x28) (R/W 32) Channel Configuration Register -------- */
#define XDMAC_CC_TYPE_Pos                     _UINT32_(0)                                          /* (XDMAC_CC) Channel x Transfer Type Position */
#define XDMAC_CC_TYPE_Msk                     (_UINT32_(0x1) << XDMAC_CC_TYPE_Pos)                 /* (XDMAC_CC) Channel x Transfer Type Mask */
#define XDMAC_CC_TYPE(value)                  (XDMAC_CC_TYPE_Msk & (_UINT32_(value) << XDMAC_CC_TYPE_Pos)) /* Assignment of value for TYPE in the XDMAC_CC register */
#define   XDMAC_CC_TYPE_MEM_TRAN_Val          _UINT32_(0x0)                                        /* (XDMAC_CC) Self-triggered mode (memory-to-memory transfer).  */
#define   XDMAC_CC_TYPE_PER_TRAN_Val          _UINT32_(0x1)                                        /* (XDMAC_CC) Synchronized mode (peripheral-to-memory or memory-to-peripheral transfer).  */
#define XDMAC_CC_TYPE_MEM_TRAN                (XDMAC_CC_TYPE_MEM_TRAN_Val << XDMAC_CC_TYPE_Pos)    /* (XDMAC_CC) Self-triggered mode (memory-to-memory transfer). Position */
#define XDMAC_CC_TYPE_PER_TRAN                (XDMAC_CC_TYPE_PER_TRAN_Val << XDMAC_CC_TYPE_Pos)    /* (XDMAC_CC) Synchronized mode (peripheral-to-memory or memory-to-peripheral transfer). Position */
#define XDMAC_CC_MBSIZE_Pos                   _UINT32_(1)                                          /* (XDMAC_CC) Channel x Memory Burst Size Position */
#define XDMAC_CC_MBSIZE_Msk                   (_UINT32_(0x3) << XDMAC_CC_MBSIZE_Pos)               /* (XDMAC_CC) Channel x Memory Burst Size Mask */
#define XDMAC_CC_MBSIZE(value)                (XDMAC_CC_MBSIZE_Msk & (_UINT32_(value) << XDMAC_CC_MBSIZE_Pos)) /* Assignment of value for MBSIZE in the XDMAC_CC register */
#define   XDMAC_CC_MBSIZE_SINGLE_Val          _UINT32_(0x0)                                        /* (XDMAC_CC) The memory burst size is set to one.  */
#define   XDMAC_CC_MBSIZE_FOUR_Val            _UINT32_(0x1)                                        /* (XDMAC_CC) The memory burst size is set to four.  */
#define   XDMAC_CC_MBSIZE_EIGHT_Val           _UINT32_(0x2)                                        /* (XDMAC_CC) The memory burst size is set to eight.  */
#define   XDMAC_CC_MBSIZE_SIXTEEN_Val         _UINT32_(0x3)                                        /* (XDMAC_CC) The memory burst size is set to sixteen.  */
#define XDMAC_CC_MBSIZE_SINGLE                (XDMAC_CC_MBSIZE_SINGLE_Val << XDMAC_CC_MBSIZE_Pos)  /* (XDMAC_CC) The memory burst size is set to one. Position */
#define XDMAC_CC_MBSIZE_FOUR                  (XDMAC_CC_MBSIZE_FOUR_Val << XDMAC_CC_MBSIZE_Pos)    /* (XDMAC_CC) The memory burst size is set to four. Position */
#define XDMAC_CC_MBSIZE_EIGHT                 (XDMAC_CC_MBSIZE_EIGHT_Val << XDMAC_CC_MBSIZE_Pos)   /* (XDMAC_CC) The memory burst size is set to eight. Position */
#define XDMAC_CC_MBSIZE_SIXTEEN               (XDMAC_CC_MBSIZE_SIXTEEN_Val << XDMAC_CC_MBSIZE_Pos) /* (XDMAC_CC) The memory burst size is set to sixteen. Position */
#define XDMAC_CC_DSYNC_Pos                    _UINT32_(4)                                          /* (XDMAC_CC) Channel x Synchronization Position */
#define XDMAC_CC_DSYNC_Msk                    (_UINT32_(0x1) << XDMAC_CC_DSYNC_Pos)                /* (XDMAC_CC) Channel x Synchronization Mask */
#define XDMAC_CC_DSYNC(value)                 (XDMAC_CC_DSYNC_Msk & (_UINT32_(value) << XDMAC_CC_DSYNC_Pos)) /* Assignment of value for DSYNC in the XDMAC_CC register */
#define   XDMAC_CC_DSYNC_PER2MEM_Val          _UINT32_(0x0)                                        /* (XDMAC_CC) Peripheral-to-memory transfer.  */
#define   XDMAC_CC_DSYNC_MEM2PER_Val          _UINT32_(0x1)                                        /* (XDMAC_CC) Memory-to-peripheral transfer.  */
#define XDMAC_CC_DSYNC_PER2MEM                (XDMAC_CC_DSYNC_PER2MEM_Val << XDMAC_CC_DSYNC_Pos)   /* (XDMAC_CC) Peripheral-to-memory transfer. Position */
#define XDMAC_CC_DSYNC_MEM2PER                (XDMAC_CC_DSYNC_MEM2PER_Val << XDMAC_CC_DSYNC_Pos)   /* (XDMAC_CC) Memory-to-peripheral transfer. Position */
#define XDMAC_CC_SWREQ_Pos                    _UINT32_(6)                                          /* (XDMAC_CC) Channel x Software Request Trigger Position */
#define XDMAC_CC_SWREQ_Msk                    (_UINT32_(0x1) << XDMAC_CC_SWREQ_Pos)                /* (XDMAC_CC) Channel x Software Request Trigger Mask */
#define XDMAC_CC_SWREQ(value)                 (XDMAC_CC_SWREQ_Msk & (_UINT32_(value) << XDMAC_CC_SWREQ_Pos)) /* Assignment of value for SWREQ in the XDMAC_CC register */
#define   XDMAC_CC_SWREQ_HWR_CONNECTED_Val    _UINT32_(0x0)                                        /* (XDMAC_CC) Hardware request line is connected to the peripheral request line.  */
#define   XDMAC_CC_SWREQ_SWR_CONNECTED_Val    _UINT32_(0x1)                                        /* (XDMAC_CC) Software request is connected to the peripheral request line.  */
#define XDMAC_CC_SWREQ_HWR_CONNECTED          (XDMAC_CC_SWREQ_HWR_CONNECTED_Val << XDMAC_CC_SWREQ_Pos) /* (XDMAC_CC) Hardware request line is connected to the peripheral request line. Position */
#define XDMAC_CC_SWREQ_SWR_CONNECTED          (XDMAC_CC_SWREQ_SWR_CONNECTED_Val << XDMAC_CC_SWREQ_Pos) /* (XDMAC_CC) Software request is connected to the peripheral request line. Position */
#define XDMAC_CC_MEMSET_Pos                   _UINT32_(7)                                          /* (XDMAC_CC) Channel x Fill Block of memory Position */
#define XDMAC_CC_MEMSET_Msk                   (_UINT32_(0x1) << XDMAC_CC_MEMSET_Pos)               /* (XDMAC_CC) Channel x Fill Block of memory Mask */
#define XDMAC_CC_MEMSET(value)                (XDMAC_CC_MEMSET_Msk & (_UINT32_(value) << XDMAC_CC_MEMSET_Pos)) /* Assignment of value for MEMSET in the XDMAC_CC register */
#define   XDMAC_CC_MEMSET_NORMAL_MODE_Val     _UINT32_(0x0)                                        /* (XDMAC_CC) Memset is not activated.  */
#define   XDMAC_CC_MEMSET_HW_MODE_Val         _UINT32_(0x1)                                        /* (XDMAC_CC) Sets the block of memory pointed by DA field to the specified value. This operation is performed on 8-, 16- or 32-bit basis.  */
#define XDMAC_CC_MEMSET_NORMAL_MODE           (XDMAC_CC_MEMSET_NORMAL_MODE_Val << XDMAC_CC_MEMSET_Pos) /* (XDMAC_CC) Memset is not activated. Position */
#define XDMAC_CC_MEMSET_HW_MODE               (XDMAC_CC_MEMSET_HW_MODE_Val << XDMAC_CC_MEMSET_Pos) /* (XDMAC_CC) Sets the block of memory pointed by DA field to the specified value. This operation is performed on 8-, 16- or 32-bit basis. Position */
#define XDMAC_CC_CSIZE_Pos                    _UINT32_(8)                                          /* (XDMAC_CC) Channel x Chunk Size Position */
#define XDMAC_CC_CSIZE_Msk                    (_UINT32_(0x7) << XDMAC_CC_CSIZE_Pos)                /* (XDMAC_CC) Channel x Chunk Size Mask */
#define XDMAC_CC_CSIZE(value)                 (XDMAC_CC_CSIZE_Msk & (_UINT32_(value) << XDMAC_CC_CSIZE_Pos)) /* Assignment of value for CSIZE in the XDMAC_CC register */
#define   XDMAC_CC_CSIZE_CHK_1_Val            _UINT32_(0x0)                                        /* (XDMAC_CC) 1 data transferred  */
#define   XDMAC_CC_CSIZE_CHK_2_Val            _UINT32_(0x1)                                        /* (XDMAC_CC) 2 data transferred  */
#define   XDMAC_CC_CSIZE_CHK_4_Val            _UINT32_(0x2)                                        /* (XDMAC_CC) 4 data transferred  */
#define   XDMAC_CC_CSIZE_CHK_8_Val            _UINT32_(0x3)                                        /* (XDMAC_CC) 8 data transferred  */
#define   XDMAC_CC_CSIZE_CHK_16_Val           _UINT32_(0x4)                                        /* (XDMAC_CC) 16 data transferred  */
#define XDMAC_CC_CSIZE_CHK_1                  (XDMAC_CC_CSIZE_CHK_1_Val << XDMAC_CC_CSIZE_Pos)     /* (XDMAC_CC) 1 data transferred Position */
#define XDMAC_CC_CSIZE_CHK_2                  (XDMAC_CC_CSIZE_CHK_2_Val << XDMAC_CC_CSIZE_Pos)     /* (XDMAC_CC) 2 data transferred Position */
#define XDMAC_CC_CSIZE_CHK_4                  (XDMAC_CC_CSIZE_CHK_4_Val << XDMAC_CC_CSIZE_Pos)     /* (XDMAC_CC) 4 data transferred Position */
#define XDMAC_CC_CSIZE_CHK_8                  (XDMAC_CC_CSIZE_CHK_8_Val << XDMAC_CC_CSIZE_Pos)     /* (XDMAC_CC) 8 data transferred Position */
#define XDMAC_CC_CSIZE_CHK_16                 (XDMAC_CC_CSIZE_CHK_16_Val << XDMAC_CC_CSIZE_Pos)    /* (XDMAC_CC) 16 data transferred Position */
#define XDMAC_CC_DWIDTH_Pos                   _UINT32_(11)                                         /* (XDMAC_CC) Channel x Data Width Position */
#define XDMAC_CC_DWIDTH_Msk                   (_UINT32_(0x3) << XDMAC_CC_DWIDTH_Pos)               /* (XDMAC_CC) Channel x Data Width Mask */
#define XDMAC_CC_DWIDTH(value)                (XDMAC_CC_DWIDTH_Msk & (_UINT32_(value) << XDMAC_CC_DWIDTH_Pos)) /* Assignment of value for DWIDTH in the XDMAC_CC register */
#define   XDMAC_CC_DWIDTH_BYTE_Val            _UINT32_(0x0)                                        /* (XDMAC_CC) The data size is set to 8 bits  */
#define   XDMAC_CC_DWIDTH_HALFWORD_Val        _UINT32_(0x1)                                        /* (XDMAC_CC) The data size is set to 16 bits  */
#define   XDMAC_CC_DWIDTH_WORD_Val            _UINT32_(0x2)                                        /* (XDMAC_CC) The data size is set to 32 bits  */
#define XDMAC_CC_DWIDTH_BYTE                  (XDMAC_CC_DWIDTH_BYTE_Val << XDMAC_CC_DWIDTH_Pos)    /* (XDMAC_CC) The data size is set to 8 bits Position */
#define XDMAC_CC_DWIDTH_HALFWORD              (XDMAC_CC_DWIDTH_HALFWORD_Val << XDMAC_CC_DWIDTH_Pos) /* (XDMAC_CC) The data size is set to 16 bits Position */
#define XDMAC_CC_DWIDTH_WORD                  (XDMAC_CC_DWIDTH_WORD_Val << XDMAC_CC_DWIDTH_Pos)    /* (XDMAC_CC) The data size is set to 32 bits Position */
#define XDMAC_CC_SIF_Pos                      _UINT32_(13)                                         /* (XDMAC_CC) Channel x Source Interface Identifier Position */
#define XDMAC_CC_SIF_Msk                      (_UINT32_(0x1) << XDMAC_CC_SIF_Pos)                  /* (XDMAC_CC) Channel x Source Interface Identifier Mask */
#define XDMAC_CC_SIF(value)                   (XDMAC_CC_SIF_Msk & (_UINT32_(value) << XDMAC_CC_SIF_Pos)) /* Assignment of value for SIF in the XDMAC_CC register */
#define   XDMAC_CC_SIF_AHB_IF0_Val            _UINT32_(0x0)                                        /* (XDMAC_CC) The data is read through the system bus interface 0.  */
#define   XDMAC_CC_SIF_AHB_IF1_Val            _UINT32_(0x1)                                        /* (XDMAC_CC) The data is read through the system bus interface 1.  */
#define XDMAC_CC_SIF_AHB_IF0                  (XDMAC_CC_SIF_AHB_IF0_Val << XDMAC_CC_SIF_Pos)       /* (XDMAC_CC) The data is read through the system bus interface 0. Position */
#define XDMAC_CC_SIF_AHB_IF1                  (XDMAC_CC_SIF_AHB_IF1_Val << XDMAC_CC_SIF_Pos)       /* (XDMAC_CC) The data is read through the system bus interface 1. Position */
#define XDMAC_CC_DIF_Pos                      _UINT32_(14)                                         /* (XDMAC_CC) Channel x Destination Interface Identifier Position */
#define XDMAC_CC_DIF_Msk                      (_UINT32_(0x1) << XDMAC_CC_DIF_Pos)                  /* (XDMAC_CC) Channel x Destination Interface Identifier Mask */
#define XDMAC_CC_DIF(value)                   (XDMAC_CC_DIF_Msk & (_UINT32_(value) << XDMAC_CC_DIF_Pos)) /* Assignment of value for DIF in the XDMAC_CC register */
#define   XDMAC_CC_DIF_AHB_IF0_Val            _UINT32_(0x0)                                        /* (XDMAC_CC) The data is written through the system bus interface 0.  */
#define   XDMAC_CC_DIF_AHB_IF1_Val            _UINT32_(0x1)                                        /* (XDMAC_CC) The data is written though the system bus interface 1.  */
#define XDMAC_CC_DIF_AHB_IF0                  (XDMAC_CC_DIF_AHB_IF0_Val << XDMAC_CC_DIF_Pos)       /* (XDMAC_CC) The data is written through the system bus interface 0. Position */
#define XDMAC_CC_DIF_AHB_IF1                  (XDMAC_CC_DIF_AHB_IF1_Val << XDMAC_CC_DIF_Pos)       /* (XDMAC_CC) The data is written though the system bus interface 1. Position */
#define XDMAC_CC_SAM_Pos                      _UINT32_(16)                                         /* (XDMAC_CC) Channel x Source Addressing Mode Position */
#define XDMAC_CC_SAM_Msk                      (_UINT32_(0x3) << XDMAC_CC_SAM_Pos)                  /* (XDMAC_CC) Channel x Source Addressing Mode Mask */
#define XDMAC_CC_SAM(value)                   (XDMAC_CC_SAM_Msk & (_UINT32_(value) << XDMAC_CC_SAM_Pos)) /* Assignment of value for SAM in the XDMAC_CC register */
#define   XDMAC_CC_SAM_FIXED_AM_Val           _UINT32_(0x0)                                        /* (XDMAC_CC) The address remains unchanged.  */
#define   XDMAC_CC_SAM_INCREMENTED_AM_Val     _UINT32_(0x1)                                        /* (XDMAC_CC) The addressing mode is incremented (the increment size is set to the data size).  */
#define   XDMAC_CC_SAM_UBS_AM_Val             _UINT32_(0x2)                                        /* (XDMAC_CC) The microblock stride is added at the microblock boundary.  */
#define   XDMAC_CC_SAM_UBS_DS_AM_Val          _UINT32_(0x3)                                        /* (XDMAC_CC) The microblock stride is added at the microblock boundary, the data stride is added at the data boundary.  */
#define XDMAC_CC_SAM_FIXED_AM                 (XDMAC_CC_SAM_FIXED_AM_Val << XDMAC_CC_SAM_Pos)      /* (XDMAC_CC) The address remains unchanged. Position */
#define XDMAC_CC_SAM_INCREMENTED_AM           (XDMAC_CC_SAM_INCREMENTED_AM_Val << XDMAC_CC_SAM_Pos) /* (XDMAC_CC) The addressing mode is incremented (the increment size is set to the data size). Position */
#define XDMAC_CC_SAM_UBS_AM                   (XDMAC_CC_SAM_UBS_AM_Val << XDMAC_CC_SAM_Pos)        /* (XDMAC_CC) The microblock stride is added at the microblock boundary. Position */
#define XDMAC_CC_SAM_UBS_DS_AM                (XDMAC_CC_SAM_UBS_DS_AM_Val << XDMAC_CC_SAM_Pos)     /* (XDMAC_CC) The microblock stride is added at the microblock boundary, the data stride is added at the data boundary. Position */
#define XDMAC_CC_DAM_Pos                      _UINT32_(18)                                         /* (XDMAC_CC) Channel x Destination Addressing Mode Position */
#define XDMAC_CC_DAM_Msk                      (_UINT32_(0x3) << XDMAC_CC_DAM_Pos)                  /* (XDMAC_CC) Channel x Destination Addressing Mode Mask */
#define XDMAC_CC_DAM(value)                   (XDMAC_CC_DAM_Msk & (_UINT32_(value) << XDMAC_CC_DAM_Pos)) /* Assignment of value for DAM in the XDMAC_CC register */
#define   XDMAC_CC_DAM_FIXED_AM_Val           _UINT32_(0x0)                                        /* (XDMAC_CC) The address remains unchanged.  */
#define   XDMAC_CC_DAM_INCREMENTED_AM_Val     _UINT32_(0x1)                                        /* (XDMAC_CC) The addressing mode is incremented (the increment size is set to the data size).  */
#define   XDMAC_CC_DAM_UBS_AM_Val             _UINT32_(0x2)                                        /* (XDMAC_CC) The microblock stride is added at the microblock boundary.  */
#define   XDMAC_CC_DAM_UBS_DS_AM_Val          _UINT32_(0x3)                                        /* (XDMAC_CC) The microblock stride is added at the microblock boundary; the data stride is added at the data boundary.  */
#define XDMAC_CC_DAM_FIXED_AM                 (XDMAC_CC_DAM_FIXED_AM_Val << XDMAC_CC_DAM_Pos)      /* (XDMAC_CC) The address remains unchanged. Position */
#define XDMAC_CC_DAM_INCREMENTED_AM           (XDMAC_CC_DAM_INCREMENTED_AM_Val << XDMAC_CC_DAM_Pos) /* (XDMAC_CC) The addressing mode is incremented (the increment size is set to the data size). Position */
#define XDMAC_CC_DAM_UBS_AM                   (XDMAC_CC_DAM_UBS_AM_Val << XDMAC_CC_DAM_Pos)        /* (XDMAC_CC) The microblock stride is added at the microblock boundary. Position */
#define XDMAC_CC_DAM_UBS_DS_AM                (XDMAC_CC_DAM_UBS_DS_AM_Val << XDMAC_CC_DAM_Pos)     /* (XDMAC_CC) The microblock stride is added at the microblock boundary; the data stride is added at the data boundary. Position */
#define XDMAC_CC_INITD_Pos                    _UINT32_(21)                                         /* (XDMAC_CC) Channel Initialization Terminated (this bit is read-only) Position */
#define XDMAC_CC_INITD_Msk                    (_UINT32_(0x1) << XDMAC_CC_INITD_Pos)                /* (XDMAC_CC) Channel Initialization Terminated (this bit is read-only) Mask */
#define XDMAC_CC_INITD(value)                 (XDMAC_CC_INITD_Msk & (_UINT32_(value) << XDMAC_CC_INITD_Pos)) /* Assignment of value for INITD in the XDMAC_CC register */
#define   XDMAC_CC_INITD_IN_PROGRESS_Val      _UINT32_(0x0)                                        /* (XDMAC_CC) Channel initialization is in progress.  */
#define   XDMAC_CC_INITD_TERMINATED_Val       _UINT32_(0x1)                                        /* (XDMAC_CC) Channel initialization is completed.  */
#define XDMAC_CC_INITD_IN_PROGRESS            (XDMAC_CC_INITD_IN_PROGRESS_Val << XDMAC_CC_INITD_Pos) /* (XDMAC_CC) Channel initialization is in progress. Position */
#define XDMAC_CC_INITD_TERMINATED             (XDMAC_CC_INITD_TERMINATED_Val << XDMAC_CC_INITD_Pos) /* (XDMAC_CC) Channel initialization is completed. Position */
#define XDMAC_CC_RDIP_Pos                     _UINT32_(22)                                         /* (XDMAC_CC) Read in Progress (this bit is read-only) Position */
#define XDMAC_CC_RDIP_Msk                     (_UINT32_(0x1) << XDMAC_CC_RDIP_Pos)                 /* (XDMAC_CC) Read in Progress (this bit is read-only) Mask */
#define XDMAC_CC_RDIP(value)                  (XDMAC_CC_RDIP_Msk & (_UINT32_(value) << XDMAC_CC_RDIP_Pos)) /* Assignment of value for RDIP in the XDMAC_CC register */
#define   XDMAC_CC_RDIP_DONE_Val              _UINT32_(0x0)                                        /* (XDMAC_CC) No active read transaction on the bus.  */
#define   XDMAC_CC_RDIP_IN_PROGRESS_Val       _UINT32_(0x1)                                        /* (XDMAC_CC) A read transaction is in progress.  */
#define XDMAC_CC_RDIP_DONE                    (XDMAC_CC_RDIP_DONE_Val << XDMAC_CC_RDIP_Pos)        /* (XDMAC_CC) No active read transaction on the bus. Position */
#define XDMAC_CC_RDIP_IN_PROGRESS             (XDMAC_CC_RDIP_IN_PROGRESS_Val << XDMAC_CC_RDIP_Pos) /* (XDMAC_CC) A read transaction is in progress. Position */
#define XDMAC_CC_WRIP_Pos                     _UINT32_(23)                                         /* (XDMAC_CC) Write in Progress (this bit is read-only) Position */
#define XDMAC_CC_WRIP_Msk                     (_UINT32_(0x1) << XDMAC_CC_WRIP_Pos)                 /* (XDMAC_CC) Write in Progress (this bit is read-only) Mask */
#define XDMAC_CC_WRIP(value)                  (XDMAC_CC_WRIP_Msk & (_UINT32_(value) << XDMAC_CC_WRIP_Pos)) /* Assignment of value for WRIP in the XDMAC_CC register */
#define   XDMAC_CC_WRIP_DONE_Val              _UINT32_(0x0)                                        /* (XDMAC_CC) No active write transaction on the bus.  */
#define   XDMAC_CC_WRIP_IN_PROGRESS_Val       _UINT32_(0x1)                                        /* (XDMAC_CC) A write transaction is in progress.  */
#define XDMAC_CC_WRIP_DONE                    (XDMAC_CC_WRIP_DONE_Val << XDMAC_CC_WRIP_Pos)        /* (XDMAC_CC) No active write transaction on the bus. Position */
#define XDMAC_CC_WRIP_IN_PROGRESS             (XDMAC_CC_WRIP_IN_PROGRESS_Val << XDMAC_CC_WRIP_Pos) /* (XDMAC_CC) A write transaction is in progress. Position */
#define XDMAC_CC_PERID_Pos                    _UINT32_(24)                                         /* (XDMAC_CC) Channel x Peripheral Hardware Request Line Identifier Position */
#define XDMAC_CC_PERID_Msk                    (_UINT32_(0x7F) << XDMAC_CC_PERID_Pos)               /* (XDMAC_CC) Channel x Peripheral Hardware Request Line Identifier Mask */
#define XDMAC_CC_PERID(value)                 (XDMAC_CC_PERID_Msk & (_UINT32_(value) << XDMAC_CC_PERID_Pos)) /* Assignment of value for PERID in the XDMAC_CC register */
#define   XDMAC_CC_PERID_HSMCI_Val            _UINT32_(0x0)                                        /* (XDMAC_CC) HSMCI  */
#define   XDMAC_CC_PERID_SPI0_TX_Val          _UINT32_(0x1)                                        /* (XDMAC_CC) SPI0_TX  */
#define   XDMAC_CC_PERID_SPI0_RX_Val          _UINT32_(0x2)                                        /* (XDMAC_CC) SPI0_RX  */
#define   XDMAC_CC_PERID_SPI1_TX_Val          _UINT32_(0x3)                                        /* (XDMAC_CC) SPI1_TX  */
#define   XDMAC_CC_PERID_SPI1_RX_Val          _UINT32_(0x4)                                        /* (XDMAC_CC) SPI1_RX  */
#define   XDMAC_CC_PERID_QSPI_TX_Val          _UINT32_(0x5)                                        /* (XDMAC_CC) QSPI_TX  */
#define   XDMAC_CC_PERID_QSPI_RX_Val          _UINT32_(0x6)                                        /* (XDMAC_CC) QSPI_RX  */
#define   XDMAC_CC_PERID_USART0_TX_Val        _UINT32_(0x7)                                        /* (XDMAC_CC) USART0_TX  */
#define   XDMAC_CC_PERID_USART0_RX_Val        _UINT32_(0x8)                                        /* (XDMAC_CC) USART0_RX  */
#define   XDMAC_CC_PERID_USART1_TX_Val        _UINT32_(0x9)                                        /* (XDMAC_CC) USART1_TX  */
#define   XDMAC_CC_PERID_USART1_RX_Val        _UINT32_(0xA)                                        /* (XDMAC_CC) USART1_RX  */
#define   XDMAC_CC_PERID_USART2_TX_Val        _UINT32_(0xB)                                        /* (XDMAC_CC) USART2_TX  */
#define   XDMAC_CC_PERID_USART2_RX_Val        _UINT32_(0xC)                                        /* (XDMAC_CC) USART2_RX  */
#define   XDMAC_CC_PERID_PWM0_Val             _UINT32_(0xD)                                        /* (XDMAC_CC) PWM0  */
#define   XDMAC_CC_PERID_TWIHS0_TX_Val        _UINT32_(0xE)                                        /* (XDMAC_CC) TWIHS0_TX  */
#define   XDMAC_CC_PERID_TWIHS0_RX_Val        _UINT32_(0xF)                                        /* (XDMAC_CC) TWIHS0_RX  */
#define   XDMAC_CC_PERID_TWIHS1_TX_Val        _UINT32_(0x10)                                       /* (XDMAC_CC) TWIHS1_TX  */
#define   XDMAC_CC_PERID_TWIHS1_RX_Val        _UINT32_(0x11)                                       /* (XDMAC_CC) TWIHS1_RX  */
#define   XDMAC_CC_PERID_TWIHS2_TX_Val        _UINT32_(0x12)                                       /* (XDMAC_CC) TWIHS2_TX  */
#define   XDMAC_CC_PERID_TWIHS2_RX_Val        _UINT32_(0x13)                                       /* (XDMAC_CC) TWIHS2_RX  */
#define   XDMAC_CC_PERID_UART0_TX_Val         _UINT32_(0x14)                                       /* (XDMAC_CC) UART0_TX  */
#define   XDMAC_CC_PERID_UART0_RX_Val         _UINT32_(0x15)                                       /* (XDMAC_CC) UART0_RX  */
#define   XDMAC_CC_PERID_UART1_TX_Val         _UINT32_(0x16)                                       /* (XDMAC_CC) UART1_TX  */
#define   XDMAC_CC_PERID_UART1_RX_Val         _UINT32_(0x17)                                       /* (XDMAC_CC) UART1_RX  */
#define   XDMAC_CC_PERID_UART2_TX_Val         _UINT32_(0x18)                                       /* (XDMAC_CC) UART2_TX  */
#define   XDMAC_CC_PERID_UART2_RX_Val         _UINT32_(0x19)                                       /* (XDMAC_CC) UART2_RX  */
#define   XDMAC_CC_PERID_UART3_TX_Val         _UINT32_(0x1A)                                       /* (XDMAC_CC) UART3_TX  */
#define   XDMAC_CC_PERID_UART3_RX_Val         _UINT32_(0x1B)                                       /* (XDMAC_CC) UART3_RX  */
#define   XDMAC_CC_PERID_UART4_TX_Val         _UINT32_(0x1C)                                       /* (XDMAC_CC) UART4_TX  */
#define   XDMAC_CC_PERID_UART4_RX_Val         _UINT32_(0x1D)                                       /* (XDMAC_CC) UART4_RX  */
