MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/xdmac.h
/* -------- XDMAC_GID : (XDMAC Offset: 0x10) ( /W 32) Global Interrupt Disable Register -------- */
#define XDMAC_GID_ID0_Pos                     _UINT32_(0)                                          /* (XDMAC_GID) XDMAC Channel 0 Interrupt Disable Bit Position */
#define XDMAC_GID_ID0_Msk                     (_UINT32_(0x1) << XDMAC_GID_ID0_Pos)                 /* (XDMAC_GID) XDMAC Channel 0 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID0(value)                  (XDMAC_GID_ID0_Msk & (_UINT32_(value) << XDMAC_GID_ID0_Pos)) /* Assignment of value for ID0 in the XDMAC_GID register */
#define XDMAC_GID_ID1_Pos                     _UINT32_(1)                                          /* (XDMAC_GID) XDMAC Channel 1 Interrupt Disable Bit Position */
#define XDMAC_GID_ID1_Msk                     (_UINT32_(0x1) << XDMAC_GID_ID1_Pos)                 /* (XDMAC_GID) XDMAC Channel 1 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID1(value)                  (XDMAC_GID_ID1_Msk & (_UINT32_(value) << XDMAC_GID_ID1_Pos)) /* Assignment of value for ID1 in the XDMAC_GID register */
#define XDMAC_GID_ID2_Pos                     _UINT32_(2)                                          /* (XDMAC_GID) XDMAC Channel 2 Interrupt Disable Bit Position */
#define XDMAC_GID_ID2_Msk                     (_UINT32_(0x1) << XDMAC_GID_ID2_Pos)                 /* (XDMAC_GID) XDMAC Channel 2 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID2(value)                  (XDMAC_GID_ID2_Msk & (_UINT32_(value) << XDMAC_GID_ID2_Pos)) /* Assignment of value for ID2 in the XDMAC_GID register */
#define XDMAC_GID_ID3_Pos                     _UINT32_(3)                                          /* (XDMAC_GID) XDMAC Channel 3 Interrupt Disable Bit Position */
#define XDMAC_GID_ID3_Msk                     (_UINT32_(0x1) << XDMAC_GID_ID3_Pos)                 /* (XDMAC_GID) XDMAC Channel 3 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID3(value)                  (XDMAC_GID_ID3_Msk & (_UINT32_(value) << XDMAC_GID_ID3_Pos)) /* Assignment of value for ID3 in the XDMAC_GID register */
#define XDMAC_GID_ID4_Pos                     _UINT32_(4)                                          /* (XDMAC_GID) XDMAC Channel 4 Interrupt Disable Bit Position */
#define XDMAC_GID_ID4_Msk                     (_UINT32_(0x1) << XDMAC_GID_ID4_Pos)                 /* (XDMAC_GID) XDMAC Channel 4 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID4(value)                  (XDMAC_GID_ID4_Msk & (_UINT32_(value) << XDMAC_GID_ID4_Pos)) /* Assignment of value for ID4 in the XDMAC_GID register */
#define XDMAC_GID_ID5_Pos                     _UINT32_(5)                                          /* (XDMAC_GID) XDMAC Channel 5 Interrupt Disable Bit Position */
#define XDMAC_GID_ID5_Msk                     (_UINT32_(0x1) << XDMAC_GID_ID5_Pos)                 /* (XDMAC_GID) XDMAC Channel 5 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID5(value)                  (XDMAC_GID_ID5_Msk & (_UINT32_(value) << XDMAC_GID_ID5_Pos)) /* Assignment of value for ID5 in the XDMAC_GID register */
#define XDMAC_GID_ID6_Pos                     _UINT32_(6)                                          /* (XDMAC_GID) XDMAC Channel 6 Interrupt Disable Bit Position */
#define XDMAC_GID_ID6_Msk                     (_UINT32_(0x1) << XDMAC_GID_ID6_Pos)                 /* (XDMAC_GID) XDMAC Channel 6 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID6(value)                  (XDMAC_GID_ID6_Msk & (_UINT32_(value) << XDMAC_GID_ID6_Pos)) /* Assignment of value for ID6 in the XDMAC_GID register */
#define XDMAC_GID_ID7_Pos                     _UINT32_(7)                                          /* (XDMAC_GID) XDMAC Channel 7 Interrupt Disable Bit Position */
#define XDMAC_GID_ID7_Msk                     (_UINT32_(0x1) << XDMAC_GID_ID7_Pos)                 /* (XDMAC_GID) XDMAC Channel 7 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID7(value)                  (XDMAC_GID_ID7_Msk & (_UINT32_(value) << XDMAC_GID_ID7_Pos)) /* Assignment of value for ID7 in the XDMAC_GID register */
#define XDMAC_GID_ID8_Pos                     _UINT32_(8)                                          /* (XDMAC_GID) XDMAC Channel 8 Interrupt Disable Bit Position */
#define XDMAC_GID_ID8_Msk                     (_UINT32_(0x1) << XDMAC_GID_ID8_Pos)                 /* (XDMAC_GID) XDMAC Channel 8 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID8(value)                  (XDMAC_GID_ID8_Msk & (_UINT32_(value) << XDMAC_GID_ID8_Pos)) /* Assignment of value for ID8 in the XDMAC_GID register */
#define XDMAC_GID_ID9_Pos                     _UINT32_(9)                                          /* (XDMAC_GID) XDMAC Channel 9 Interrupt Disable Bit Position */
#define XDMAC_GID_ID9_Msk                     (_UINT32_(0x1) << XDMAC_GID_ID9_Pos)                 /* (XDMAC_GID) XDMAC Channel 9 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID9(value)                  (XDMAC_GID_ID9_Msk & (_UINT32_(value) << XDMAC_GID_ID9_Pos)) /* Assignment of value for ID9 in the XDMAC_GID register */
#define XDMAC_GID_ID10_Pos                    _UINT32_(10)                                         /* (XDMAC_GID) XDMAC Channel 10 Interrupt Disable Bit Position */
#define XDMAC_GID_ID10_Msk                    (_UINT32_(0x1) << XDMAC_GID_ID10_Pos)                /* (XDMAC_GID) XDMAC Channel 10 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID10(value)                 (XDMAC_GID_ID10_Msk & (_UINT32_(value) << XDMAC_GID_ID10_Pos)) /* Assignment of value for ID10 in the XDMAC_GID register */
#define XDMAC_GID_ID11_Pos                    _UINT32_(11)                                         /* (XDMAC_GID) XDMAC Channel 11 Interrupt Disable Bit Position */
#define XDMAC_GID_ID11_Msk                    (_UINT32_(0x1) << XDMAC_GID_ID11_Pos)                /* (XDMAC_GID) XDMAC Channel 11 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID11(value)                 (XDMAC_GID_ID11_Msk & (_UINT32_(value) << XDMAC_GID_ID11_Pos)) /* Assignment of value for ID11 in the XDMAC_GID register */
#define XDMAC_GID_ID12_Pos                    _UINT32_(12)                                         /* (XDMAC_GID) XDMAC Channel 12 Interrupt Disable Bit Position */
#define XDMAC_GID_ID12_Msk                    (_UINT32_(0x1) << XDMAC_GID_ID12_Pos)                /* (XDMAC_GID) XDMAC Channel 12 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID12(value)                 (XDMAC_GID_ID12_Msk & (_UINT32_(value) << XDMAC_GID_ID12_Pos)) /* Assignment of value for ID12 in the XDMAC_GID register */
#define XDMAC_GID_ID13_Pos                    _UINT32_(13)                                         /* (XDMAC_GID) XDMAC Channel 13 Interrupt Disable Bit Position */
#define XDMAC_GID_ID13_Msk                    (_UINT32_(0x1) << XDMAC_GID_ID13_Pos)                /* (XDMAC_GID) XDMAC Channel 13 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID13(value)                 (XDMAC_GID_ID13_Msk & (_UINT32_(value) << XDMAC_GID_ID13_Pos)) /* Assignment of value for ID13 in the XDMAC_GID register */
#define XDMAC_GID_ID14_Pos                    _UINT32_(14)                                         /* (XDMAC_GID) XDMAC Channel 14 Interrupt Disable Bit Position */
#define XDMAC_GID_ID14_Msk                    (_UINT32_(0x1) << XDMAC_GID_ID14_Pos)                /* (XDMAC_GID) XDMAC Channel 14 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID14(value)                 (XDMAC_GID_ID14_Msk & (_UINT32_(value) << XDMAC_GID_ID14_Pos)) /* Assignment of value for ID14 in the XDMAC_GID register */
#define XDMAC_GID_ID15_Pos                    _UINT32_(15)                                         /* (XDMAC_GID) XDMAC Channel 15 Interrupt Disable Bit Position */
#define XDMAC_GID_ID15_Msk                    (_UINT32_(0x1) << XDMAC_GID_ID15_Pos)                /* (XDMAC_GID) XDMAC Channel 15 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID15(value)                 (XDMAC_GID_ID15_Msk & (_UINT32_(value) << XDMAC_GID_ID15_Pos)) /* Assignment of value for ID15 in the XDMAC_GID register */
#define XDMAC_GID_ID16_Pos                    _UINT32_(16)                                         /* (XDMAC_GID) XDMAC Channel 16 Interrupt Disable Bit Position */
#define XDMAC_GID_ID16_Msk                    (_UINT32_(0x1) << XDMAC_GID_ID16_Pos)                /* (XDMAC_GID) XDMAC Channel 16 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID16(value)                 (XDMAC_GID_ID16_Msk & (_UINT32_(value) << XDMAC_GID_ID16_Pos)) /* Assignment of value for ID16 in the XDMAC_GID register */
#define XDMAC_GID_ID17_Pos                    _UINT32_(17)                                         /* (XDMAC_GID) XDMAC Channel 17 Interrupt Disable Bit Position */
#define XDMAC_GID_ID17_Msk                    (_UINT32_(0x1) << XDMAC_GID_ID17_Pos)                /* (XDMAC_GID) XDMAC Channel 17 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID17(value)                 (XDMAC_GID_ID17_Msk & (_UINT32_(value) << XDMAC_GID_ID17_Pos)) /* Assignment of value for ID17 in the XDMAC_GID register */
#define XDMAC_GID_ID18_Pos                    _UINT32_(18)                                         /* (XDMAC_GID) XDMAC Channel 18 Interrupt Disable Bit Position */
#define XDMAC_GID_ID18_Msk                    (_UINT32_(0x1) << XDMAC_GID_ID18_Pos)                /* (XDMAC_GID) XDMAC Channel 18 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID18(value)                 (XDMAC_GID_ID18_Msk & (_UINT32_(value) << XDMAC_GID_ID18_Pos)) /* Assignment of value for ID18 in the XDMAC_GID register */
#define XDMAC_GID_ID19_Pos                    _UINT32_(19)                                         /* (XDMAC_GID) XDMAC Channel 19 Interrupt Disable Bit Position */
#define XDMAC_GID_ID19_Msk                    (_UINT32_(0x1) << XDMAC_GID_ID19_Pos)                /* (XDMAC_GID) XDMAC Channel 19 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID19(value)                 (XDMAC_GID_ID19_Msk & (_UINT32_(value) << XDMAC_GID_ID19_Pos)) /* Assignment of value for ID19 in the XDMAC_GID register */
#define XDMAC_GID_ID20_Pos                    _UINT32_(20)                                         /* (XDMAC_GID) XDMAC Channel 20 Interrupt Disable Bit Position */
#define XDMAC_GID_ID20_Msk                    (_UINT32_(0x1) << XDMAC_GID_ID20_Pos)                /* (XDMAC_GID) XDMAC Channel 20 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID20(value)                 (XDMAC_GID_ID20_Msk & (_UINT32_(value) << XDMAC_GID_ID20_Pos)) /* Assignment of value for ID20 in the XDMAC_GID register */
#define XDMAC_GID_ID21_Pos                    _UINT32_(21)                                         /* (XDMAC_GID) XDMAC Channel 21 Interrupt Disable Bit Position */
#define XDMAC_GID_ID21_Msk                    (_UINT32_(0x1) << XDMAC_GID_ID21_Pos)                /* (XDMAC_GID) XDMAC Channel 21 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID21(value)                 (XDMAC_GID_ID21_Msk & (_UINT32_(value) << XDMAC_GID_ID21_Pos)) /* Assignment of value for ID21 in the XDMAC_GID register */
#define XDMAC_GID_ID22_Pos                    _UINT32_(22)                                         /* (XDMAC_GID) XDMAC Channel 22 Interrupt Disable Bit Position */
#define XDMAC_GID_ID22_Msk                    (_UINT32_(0x1) << XDMAC_GID_ID22_Pos)                /* (XDMAC_GID) XDMAC Channel 22 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID22(value)                 (XDMAC_GID_ID22_Msk & (_UINT32_(value) << XDMAC_GID_ID22_Pos)) /* Assignment of value for ID22 in the XDMAC_GID register */
#define XDMAC_GID_ID23_Pos                    _UINT32_(23)                                         /* (XDMAC_GID) XDMAC Channel 23 Interrupt Disable Bit Position */
#define XDMAC_GID_ID23_Msk                    (_UINT32_(0x1) << XDMAC_GID_ID23_Pos)                /* (XDMAC_GID) XDMAC Channel 23 Interrupt Disable Bit Mask */
#define XDMAC_GID_ID23(value)                 (XDMAC_GID_ID23_Msk & (_UINT32_(value) << XDMAC_GID_ID23_Pos)) /* Assignment of value for ID23 in the XDMAC_GID register */
#define XDMAC_GID_Msk                         _UINT32_(0x00FFFFFF)                                 /* (XDMAC_GID) Register Mask  */

#define XDMAC_GID_ID_Pos                      _UINT32_(0)                                          /* (XDMAC_GID Position) XDMAC Channel 23 Interrupt Disable Bit */
#define XDMAC_GID_ID_Msk                      (_UINT32_(0xFFFFFF) << XDMAC_GID_ID_Pos)             /* (XDMAC_GID Mask) ID */
#define XDMAC_GID_ID(value)                   (XDMAC_GID_ID_Msk & (_UINT32_(value) << XDMAC_GID_ID_Pos)) 

